from bot.info import Config

class Translation(object):

      
      START_TEXT = """
😃 𝖧𝖺𝗂 {},
𝖨 𝖺𝗆 𝖺 𝗌𝗂𝗆𝗉𝗅𝖾 𝖺𝗎𝗍𝗈 𝖢𝗁𝖺𝗇𝗇𝖾𝗅 𝖠𝗎𝗍𝗈𝗆𝖺𝗍𝗂𝗈𝗇 𝖻𝗈𝗍
𝖨 𝖺𝗆 𝗏𝖾𝗋𝗒 𝗎𝗌𝖾𝖿𝗎𝗅 𝖿𝗈𝗋 𝗍𝗁𝖾 𝖼𝗁𝖺𝗇𝗇𝖾𝗅 𝖺𝖽𝗆𝗂𝗇 𝗐𝗁𝗈 𝗁𝖺𝗏𝖾 𝗆𝖺𝗇𝗒 𝖼𝗁𝖺𝗇𝗇𝖾𝗅𝗌.😁

𝖬𝖺𝗂𝗇𝗍𝖺𝗂𝗇𝖾𝖽 𝖡𝗒: @Lx_0980
"""    
      COMMANDS_TEXT = """
      <b><u>AVAILABLE COMMAND</b></u>

• /start - 𝖡𝗈𝗍 𝖠𝗅𝗂𝗏𝖾

• /run - 𝗌𝗍𝖺𝗋𝗍 𝖿𝗈𝗋𝗐𝖺𝗋𝖽

• /info - 𝖦𝖾𝗍 𝗒𝗈𝗎𝗋 𝗍𝖾𝗅𝖾𝗀𝗋𝖺𝗆 𝖨𝖣 𝗂𝗇𝖿𝗈

• /id - 𝖦𝖾𝗍 𝖸𝗈𝗎𝗋 𝗍𝖾𝗅𝖾𝗀𝗋𝖺𝗆 𝖨𝖣
"""


      ABOUT_TEXT = """
MY DETAILS:

🤖 𝖬𝗒 𝖭𝖺𝗆𝖾: Channel Automation 

📝 𝖫𝖺𝗇𝗀𝗎𝖺𝗀𝖾: Python

🧰 𝖥𝗋𝖺𝗆𝖾𝗐𝗈𝗋𝗄: Pyrogram 2.0.69

📢 𝖢𝗁𝖺𝗇𝗇𝖾𝗅: @Lx0980_Official

👥 𝖦𝗋𝗈𝗎𝗉: @Hollywood_0980
"""
      
      FILES_CAPTION = "`{}`\n\n" + str(Config.FILES_CAPTION)
      COPY_FILES_TEXT = """<b>Follow These Steps!!</b>
• 𝖥𝗂𝗋𝗌𝗍 𝖽𝖾𝗉𝗅𝗈𝗒 𝖻𝗈𝗍
• 𝖳𝗁𝖾𝗇 𝗀𝗂𝗏𝖾 𝖺𝖽𝗆𝗂𝗇 𝗉𝖾𝗋𝗆𝗂𝗌𝗌𝗂𝗈𝗇 𝗂𝗇 𝗒𝗈𝗎𝗋 𝗉𝖾𝗋𝗌𝗈𝗇𝖺𝗅 𝗍𝖾𝗅𝖾𝗀𝗋𝖺𝗆 𝖼𝗁𝖺𝗇𝗇𝖾𝗅
• 𝖳𝗁𝖾𝗇 𝗌𝖾𝗇𝖽 𝖺𝗇𝗒 𝗆𝖾𝗌𝗌𝖺𝗀𝖾 𝖨𝗇 𝗒𝗈𝗎𝗋 𝗉𝖾𝗋𝗌𝗈𝗇𝖺𝗅 𝗍𝖾𝗅𝖾𝗀𝗋𝖺𝗆 𝖼𝗁𝖺𝗇𝗇𝖾𝗅.
• 𝖳𝗁𝖾𝗇 𝗎𝗌𝖾 /run 𝖼𝗈𝗆𝗆𝖺𝗇𝖽 𝗂𝗇 𝗒𝗈𝗎𝗋 𝖻𝗈𝗍


  𝖠𝗏𝖺𝗂𝗅𝖺𝖻𝗅𝖾 𝖢𝗈𝗆𝗆𝖺𝗇𝖽

• /run - 𝗌𝗍𝖺𝗋𝗍 𝖿𝗈𝗋𝗐𝖺𝗋𝖽
"""
